import { AzkarItemBase } from './types';

export const TASBEEH_AZKAR: AzkarItemBase[] = [
  {
    "id": 1,
    "arabic": "سُبْحَانَ اللَّهِ",
    "note": "يكتب له ألف حسنة أو يحط عنه ألف خطيئة.",
    "translation": "",
    "target": 100
  },
  {
    "id": 2,
    "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "note": "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
    "translation": "",
    "target": 100
  },
  {
    "id": 3,
    "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ",
    "note": "تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.",
    "translation": "",
    "target": 100
  },
  {
    "id": 4,
    "arabic": "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ",
    "note": "غرست له نخلة في الجنة (أى عدد).",
    "translation": "",
    "target": 100
  },
  {
    "id": 5,
    "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
    "note": "ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).",
    "translation": "",
    "target": 100
  },
  {
    "id": 6,
    "arabic": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.",
    "note": "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
    "translation": "",
    "target": 100
  },
  {
    "id": 7,
    "arabic": "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ",
    "note": "كنز من كنوز الجنة (أى عدد).",
    "translation": "",
    "target": 100
  },
  {
    "id": 8,
    "arabic": "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ",
    "note": "تملأ ميزان العبد بالحسنات.",
    "translation": "",
    "target": 100
  },
  {
    "id": 9,
    "arabic": "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد",
    "note": "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
    "translation": "",
    "target": 100
  },
  {
    "id": 10,
    "arabic": "أستغفر الله",
    "note": "لفعل الرسول صلى الله عليه وسلم.",
    "translation": "",
    "target": 100
  },
  {
    "id": 11,
    "arabic": "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ",
    "note": "أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.",
    "translation": "",
    "target": 100
  },
  {
    "id": 12,
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ",
    "note": "أفضل الذكر لا إله إلاّ الله.",
    "translation": "",
    "target": 100
  },
  {
    "id": 13,
    "arabic": "الْلَّهُ أَكْبَرُ",
    "note": "من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.",
    "translation": "",
    "target": 100
  },
  {
    "id": 14,
    "arabic": "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.",
    "note": "خير الدنيا والآخرة",
    "translation": "",
    "target": 100
  },
  {
    "id": 15,
    "arabic": "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.",
    "note": "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏\"‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا\"‏.",
    "translation": "",
    "target": 100
  },
  {
    "id": 16,
    "arabic": "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.",
    "note": "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ\".",
    "translation": "",
    "target": 100
  },
  {
    "id": 17,
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    "note": "في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).",
    "translation": "",
    "target": 100
  }
]