import { AzkarItemBase } from './types';

export const WEAKING_AZKAR: AzkarItemBase[] = [
  {
    "id": 1,
    "arabic": "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور.",
    "note": "",
    "translation": "",
    "target": 1
  },
  {
    "id": 2,
    "arabic": "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه.",
    "note": "",
    "translation": "",
    "target": 1
  },
  {
    "id": 3,
    "arabic": "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي.",
    "note": "",
    "translation": "",
    "target": 1
  }
]